In [82]:
import pandas as pd

In [83]:
#series: single column , use a list

In [84]:
series = pd.Series(["bmw","toyota","audi"])

In [85]:
series

0       bmw
1    toyota
2      audi
dtype: object

In [86]:
colors = pd.Series(["red", "blue", "green"])

In [87]:
colors

0      red
1     blue
2    green
dtype: object

In [88]:
#Data frame: two dimensional array (can use Serires to fill it), use a dictionary

In [89]:
car_data = pd.DataFrame({"car brand": series,
                        "car colour": colors})

In [90]:
car_data

  car brand car colour
0       bmw        red
1    toyota       blue
2      audi      green

In [91]:
#import data from a csv file
car_sales = pd.read_csv("7.1 car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [92]:
#exporting data from jupyter notebook
car_sales.to_csv("exported_car_sales.csv")

In [93]:
reimported_car_sales = pd.read_csv("exported_car_sales.csv", index_col=False)
reimported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [94]:
#exporting data from jupyter notebook and deleting extra index column
car_sales.to_csv("exported_car_sales2.csv", index=False)
exported_car_sales2 = pd.read_csv("exported_car_sales2.csv")
exported_car_sales2

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describeing Data

In [95]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [96]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [97]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [98]:
car_sales.describe()
#gives statistical info about numeric(int) columns

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [99]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [100]:
car_sales.mean()

/tmp/ipykernel_24062/4073448239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [101]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [102]:
car_sales["Doors"].sum()

40

In [103]:
len(car_sales)

10

## Viewing and selecting data

In [104]:
#return top five rows of dataFrame
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [105]:
car_sales.head(7) # pass a int parameter to determinate number of rows

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [106]:
#return bottom five rows
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [107]:
car_sales.tail(7) #pass int parameter to determinate number of rows

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [108]:
# .loc referes to location(index can be changed) , .iloc referes to position (static index)
animals= pd.Series(["cat","dog", "bird", "panda", "sanke"], index=[0,3,9,8,3])
animals

0      cat
3      dog
9     bird
8    panda
3    sanke
dtype: object

In [109]:
animals.loc[3]

3      dog
3    sanke
dtype: object

In [110]:
animals.loc[9]

'bird'

In [111]:
animals.iloc[3]

'panda'

In [112]:
car_sales.loc[3]  #returns an object

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [113]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [114]:
animals

0      cat
3      dog
9     bird
8    panda
3    sanke
dtype: object

In [115]:
animals.iloc[:3] # return the first 3 elements

0     cat
3     dog
9    bird
dtype: object

In [116]:
car_sales.loc[:3] #in a dataframe loc returns all the elements up to the index 3

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [117]:
car_sales.iloc[:3] # in a dataframe iloc returns all the first 3 elements (start counting from 0)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [118]:
car_sales["Make"] #select an individual column

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [119]:
car_sales.Make#select an individual column (doesnt work with spaces el: odometer km)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [120]:
car_sales[car_sales["Make"]== "Toyota"] #boolean indexing , pass a condition to filter a column

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [121]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [122]:
pd.crosstab(car_sales["Doors"], car_sales["Make"]) #compare the two given columns

Make   BMW  Honda  Nissan  Toyota
Doors
3        0      0       0       1
4        0      3       2       3
5        1      0       0       0

In [123]:
car_sales.groupby(["Make"]).mean() #mean amount of valid values of a "make" , in this case  only doors and odometer

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [ ]:
car_sales["Odometer (KM)"].plot()

In [ ]:
car_sales["Odometer (KM)"].hist()

In [124]:
car_sales

ERROR! Session/line number was not unique in database. History logging moved to new session 464

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [125]:
car_sales["Price"].dtype

ERROR! Session/line number was not unique in database. History logging moved to new session 465

dtype('O')

In [126]:
#car_sales["Price"] = car_sales.Price.str.replace("[\$\,\.]",'').astype(int)


car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]','').astype(int)

/tmp/ipykernel_24062/1345455514.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales["Price"] = car_sales["Price"].str.replace('[\$\,\.]','').astype(int)

In [ ]:
# Remove the two extra zeros at the end of the price column
car_sales["Price"] = car_sales["Price"].str[:-2]

In [127]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000
5  Toyota  Green          99213      4   450000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000
8  Toyota  White          60000      4   625000
9  Nissan  White          31600      4   970000

## Manipulating Data

In [128]:
car_sales["Make"].str.lower()

ERROR! Session/line number was not unique in database. History logging moved to new session 466

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [129]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000
5  Toyota  Green          99213      4   450000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000
8  Toyota  White          60000      4   625000
9  Nissan  White          31600      4   970000

In [130]:
car_sales["Make"] = car_sales["Make"].str.lower() #reasignemt proces to a variable,  if not the next call of car sales will not implement lower()

In [131]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  toyota  White         150043      4   400000
1   honda    Red          87899      4   500000
2  toyota   Blue          32549      3   700000
3     bmw  Black          11179      5  2200000
4  nissan  White         213095      4   350000
5  toyota  Green          99213      4   450000
6   honda   Blue          45698      4   750000
7   honda   Blue          54738      4   700000
8  toyota  White          60000      4   625000
9  nissan  White          31600      4   970000

In [132]:
car_sales_missing = pd.read_csv("9.2 car-sales-missing-data.csv")
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [133]:
car_sales_missing["Odometer"].mean()

92302.66666666667

In [134]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean()) #replace the nan value with the mean value of odometer

0    150043.000000
1     87899.000000
2     92302.666667
3     11179.000000
4    213095.000000
5     92302.666667
6     92302.666667
7     92302.666667
8     60000.000000
9     31600.000000
Name: Odometer, dtype: float64

In [135]:
car_sales_missing["Odometer"]

0    150043.0
1     87899.0
2         NaN
3     11179.0
4    213095.0
5         NaN
6         NaN
7         NaN
8     60000.0
9     31600.0
Name: Odometer, dtype: float64

In [136]:
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)
#the inplace parameter allows to asign and save the changes of fillna, you can also omitt the inplace and reasign the proces to a new variable

In [137]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [138]:
car_sales_missing.dropna() #excludes all the nan rows

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [139]:
car_sales_missing.dropna(inplace = True)

In [140]:
car_sales_missing_drop

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [141]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [142]:
car_sales_missing_drop = pd.read_csv("9.2 car-sales-missing-data.csv")

In [143]:
car_sales_missing_drop

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [144]:
car_sales_missing_droped = car_sales_missing_drop.dropna()
car_sales_missing_droped

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [145]:
car_sales_missing_drop

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [146]:
car_sales_missing_droped.to_csv("car_sales_missing_droped.csv")

## Adding Data

In [147]:
#create a column from a series
seats_columns =pd.Series([5,4,6,3,7])
seats_columns

0    5
1    4
2    6
3    3
4    7
dtype: int64

In [148]:
#add the series column to a dataset
car_sales["Seats"]= seats_columns
# if the len of the series doesnt match the len of the dataset it will be automatically filled with nan

In [149]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   400000    5.0
1   honda    Red          87899      4   500000    4.0
2  toyota   Blue          32549      3   700000    6.0
3     bmw  Black          11179      5  2200000    3.0
4  nissan  White         213095      4   350000    7.0
5  toyota  Green          99213      4   450000    NaN
6   honda   Blue          45698      4   750000    NaN
7   honda   Blue          54738      4   700000    NaN
8  toyota  White          60000      4   625000    NaN
9  nissan  White          31600      4   970000    NaN

In [150]:
car_sales["Seats"].fillna(8, inplace=True)

In [151]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   400000    5.0
1   honda    Red          87899      4   500000    4.0
2  toyota   Blue          32549      3   700000    6.0
3     bmw  Black          11179      5  2200000    3.0
4  nissan  White         213095      4   350000    7.0
5  toyota  Green          99213      4   450000    8.0
6   honda   Blue          45698      4   750000    8.0
7   honda   Blue          54738      4   700000    8.0
8  toyota  White          60000      4   625000    8.0
9  nissan  White          31600      4   970000    8.0

In [152]:
#column from a python list , the list len must be the same as the dataSet
fuel_economy = [2.1, 3.5, 6.8,7.7, 5.3,6.4, 9.0, 4.2, 8.1,9.9]
car_sales["fuel per 100KM"] = fuel_economy

In [153]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats  fuel per 100KM
0  toyota  White         150043      4   400000    5.0             2.1
1   honda    Red          87899      4   500000    4.0             3.5
2  toyota   Blue          32549      3   700000    6.0             6.8
3     bmw  Black          11179      5  2200000    3.0             7.7
4  nissan  White         213095      4   350000    7.0             5.3
5  toyota  Green          99213      4   450000    8.0             6.4
6   honda   Blue          45698      4   750000    8.0             9.0
7   honda   Blue          54738      4   700000    8.0             4.2
8  toyota  White          60000      4   625000    8.0             8.1
9  nissan  White          31600      4   970000    8.0             9.9

In [154]:
car_sales["total fuel used"]= car_sales["Odometer (KM)"]/100 * car_sales["fuel per 100KM"]

In [155]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used
0,toyota,White,150043,4,400000,5.0,2.1,3150.903
1,honda,Red,87899,4,500000,4.0,3.5,3076.465
2,toyota,Blue,32549,3,700000,6.0,6.8,2213.332
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035
5,toyota,Green,99213,4,450000,8.0,6.4,6349.632
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820
7,honda,Blue,54738,4,700000,8.0,4.2,2298.996
8,toyota,White,60000,4,625000,8.0,8.1,4860.000
9,nissan,White,31600,4,970000,8.0,9.9,3128.400

In [156]:
car_sales["total fuel used (L)"]= car_sales["Odometer (KM)"]/100 * car_sales["fuel per 100KM"]

In [157]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used,total fuel used (L)
0,toyota,White,150043,4,400000,5.0,2.1,3150.903,3150.903
1,honda,Red,87899,4,500000,4.0,3.5,3076.465,3076.465
2,toyota,Blue,32549,3,700000,6.0,6.8,2213.332,2213.332
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035,11294.035
5,toyota,Green,99213,4,450000,8.0,6.4,6349.632,6349.632
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820,4112.820
7,honda,Blue,54738,4,700000,8.0,4.2,2298.996,2298.996
8,toyota,White,60000,4,625000,8.0,8.1,4860.000,4860.000
9,nissan,White,31600,4,970000,8.0,9.9,3128.400,3128.400

In [158]:
#to drop a column use .drop and axis=1 , for rows axis=0 (error below is because it alredy drop the column and cant find it anymore)
car_sales = car_sales.drop("total fuel used",axis=1)
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used (L)
0,toyota,White,150043,4,400000,5.0,2.1,3150.903
1,honda,Red,87899,4,500000,4.0,3.5,3076.465
2,toyota,Blue,32549,3,700000,6.0,6.8,2213.332
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035
5,toyota,Green,99213,4,450000,8.0,6.4,6349.632
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820
7,honda,Blue,54738,4,700000,8.0,4.2,2298.996
8,toyota,White,60000,4,625000,8.0,8.1,4860.000
9,nissan,White,31600,4,970000,8.0,9.9,3128.400

In [159]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used (L)
0,toyota,White,150043,4,400000,5.0,2.1,3150.903
1,honda,Red,87899,4,500000,4.0,3.5,3076.465
2,toyota,Blue,32549,3,700000,6.0,6.8,2213.332
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035
5,toyota,Green,99213,4,450000,8.0,6.4,6349.632
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820
7,honda,Blue,54738,4,700000,8.0,4.2,2298.996
8,toyota,White,60000,4,625000,8.0,8.1,4860.000
9,nissan,White,31600,4,970000,8.0,9.9,3128.400

In [160]:
car_sales_shuffled = car_sales.sample(frac=1) #mixt the rows (mantein the integity of the row but not the order of index)

In [161]:
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used (L)
0,toyota,White,150043,4,400000,5.0,2.1,3150.903
5,toyota,Green,99213,4,450000,8.0,6.4,6349.632
9,nissan,White,31600,4,970000,8.0,9.9,3128.400
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035
2,toyota,Blue,32549,3,700000,6.0,6.8,2213.332
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820
8,toyota,White,60000,4,625000,8.0,8.1,4860.000
1,honda,Red,87899,4,500000,4.0,3.5,3076.465
7,honda,Blue,54738,4,700000,8.0,4.2,2298.996

In [162]:
car_sales_shuffled.reset_index(drop=True,inplace=True)# drop=true avoid addin a second index
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used (L)
0,toyota,White,150043,4,400000,5.0,2.1,3150.903
1,toyota,Green,99213,4,450000,8.0,6.4,6349.632
2,nissan,White,31600,4,970000,8.0,9.9,3128.400
3,bmw,Black,11179,5,2200000,3.0,7.7,860.783
4,nissan,White,213095,4,350000,7.0,5.3,11294.035
5,toyota,Blue,32549,3,700000,6.0,6.8,2213.332
6,honda,Blue,45698,4,750000,8.0,9.0,4112.820
7,toyota,White,60000,4,625000,8.0,8.1,4860.000
8,honda,Red,87899,4,500000,4.0,3.5,3076.465
9,honda,Blue,54738,4,700000,8.0,4.2,2298.996

In [163]:
car_sales["Odometer (KM)"]= car_sales["Odometer (KM)"].apply(lambda x : x / 1.6)
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,fuel per 100KM,total fuel used (L)
0,toyota,White,93776.875,4,400000,5.0,2.1,3150.903
1,honda,Red,54936.875,4,500000,4.0,3.5,3076.465
2,toyota,Blue,20343.125,3,700000,6.0,6.8,2213.332
3,bmw,Black,6986.875,5,2200000,3.0,7.7,860.783
4,nissan,White,133184.375,4,350000,7.0,5.3,11294.035
5,toyota,Green,62008.125,4,450000,8.0,6.4,6349.632
6,honda,Blue,28561.250,4,750000,8.0,9.0,4112.820
7,honda,Blue,34211.250,4,700000,8.0,4.2,2298.996
8,toyota,White,37500.000,4,625000,8.0,8.1,4860.000
9,nissan,White,19750.000,4,970000,8.0,9.9,3128.400